# настойки базы
WIDTH, HEIGHT = 900, 600
TILE_SIZE = 40

COLOR_KLENDATHU_ROCK = (80, 60, 50)  # Грунт
COLOR_CANYON = (40, 30, 25)  # Глубокий каньон (Дорога для жуков)
COLOR_GRID = (100, 80, 70)  # сетка
COLOR_ARACHNID = (255, 120, 0)  # Жуки
COLOR_OUTPOST = (150, 150, 150)  # аванпост
COLOR_BULLET = (255, 255, 0)  # пули
COLOR_TEXT = (255, 255, 255)
COLOR_UI_BAR = (20, 20, 20)

# Маршрут врагов (Координаты центров тайлов)
WAYPOINTS_1 = [(0, 100), (200, 100), (200, 460), (600, 460), (600, 300), (850, 300)]
WAYPOINTS_2 = [(0, 500), (120, 500), (120, 220), (400, 220), (400, 460), (850, 460)]
WAYPOINTS_3 = [(400, 0), (400, 300), (100, 300), (100, 500), (700, 500), (700, 300), (850, 300)]